<figure>
  <IMG SRC="https://www.colorado.edu/cs/profiles/express/themes/cuspirit/logo.png" WIDTH=50 ALIGN="right">
</figure>
# Pandas Data Cleaning and Grouping
*CSCI 3022 - Dirk Grunwald*

## Overview

One of the first steps for analyzing data is *cleaning* the data and extracting overviews of the data.

Common problems with data sets are missing data, mistaken entries or data being processed as an incorrect type of data. Before using a set of data, we should check that we're free of these problems.

We'll use an example of data from the Titantic passenger list. The dataset we're using is stored in CSV format (comma separated values) at a website. You can [access the raw data here](https://raw.githubusercontent.com/jorisvandenbossche/pandas-tutorial/master/data/titanic.csv). If you haven't seen a CSV file before, click the link and look at the raw text -- the format is fairly common and easily understood.

The data set commonly used in data science contests and [the Kaggle data science site has a description of the data items](https://www.kaggle.com/c/titanic/data).

In [2]:
import numpy as np
import pandas as pd

## Getting and inspecting the data

[Pandas has methods to read many types of data files](https://pandas.pydata.org/pandas-docs/stable/api.html#input-output) including CSV files, Excel files and more exotic sources from databases.

We're going to read a CSV file. The Pands ```read_csv``` routine reads data from files on your local computer and files from the web. Rather than download the file, we'll just read it from the web.

In [3]:
ti = pd.read_csv('https://raw.githubusercontent.com/jorisvandenbossche/pandas-tutorial/master/data/titanic.csv')

The first thing we're doing to do is look the first few lines of the data, using the ```head``` dataframe method.

In [4]:
ti.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

This shows the first 6 entries. We see that the frame has multiple columns, matching the description in the Kaggle site above. 

From this view, it's a little hard to know if the column names contain spaces that may make it harder to extract data -- so, let's look at the column names.

In [5]:
ti.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Pandas tries to guess the appropriate data types of each of the columns. We can look at the types for each column to see if they look correct to us.

In this list, the 'object' type that Pandas hasn't really determined the data type but it ist storing the data as a string. In our example this actually indicates strings, but in other datasets, those columns might be dates or times and we would need to convert those to a meaningful representation.

In [6]:
ti.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Examining A Column and Finding NaN

We can examine a summary of a specfic data column using the Pandas ```describe``` method:

In [7]:
ti.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

This says that there are 714 ages listed, the mean is 29.69 and so on. There's a perplexing issue -- the dataframe actually has 891 entries and even the Age column has 891 entries:

In [8]:
ti.Age.size

891

The discrepency arises because some entries contain no age information and is [missing data](http://pandas.pydata.org/pandas-docs/stable/missing_data.html). Rather than encode that age as 0 or some arbitrary number, Pandas uses a special value "NaN" (Not A Number) to indicate missing or "null" data.

NaN comes the NumPy library as np.nan. NaN is like a "poison pill" -- any arithmetic operation involving NaN becomes NaN itself and logical comparisons with NaN are always false. This is done to make it painfully clear when you're using a NaN value and to insure that you don't accidentially select NaN values when slicing data.

In [9]:
print('is 5=5?', 5==5)
print('does 5=nan?', 5 == np.nan)
print('does nan=nan?', np.nan == np.nan)
print('Is 5 < nan?', 5 < np.nan)
print('what is 5 + np.nan?', 5 + np.nan)

is 5=5? True
does 5=nan? False
does nan=nan? False
Is 5 < nan? False
what is 5 + np.nan? nan

When Pandas thinks that a column is numerical or categorical data, it substitues ```np.nan``` for the missing data.

The ```isnull()``` method returns a Boolean vector indicating if a given entry is a NaN.

We can use this to slice and examine entries that have a NaN age. Lets's build a copy of the Age column that only contains NaN entries and then look at the first few entries.

In [10]:
ti.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [11]:
print('There are', ti[ti.Age.isnull()].Age.size, 'entries with NaN ages')
ti[ti.Age.isnull()].head()

There are 177 entries with NaN ages

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

There's no clear pattern indicating why the ages aren't listed and it may be difficult to infer what the appropriate age is.

There are [three general strategies to dealing with missing data](http://pandas.pydata.org/pandas-docs/stable/missing_data.html):
* Add in a default value for the missing data
* Delete the rows that have missing data
* Delete the columns that have a high incidence of missing data

We'll do the all three to understand how to transform the data.

When adding a default value to replace NaN, we can use ```fillna``` to do the actual work, but we'll need to pick some value to enter. This could be the average age, ```ti.Age.mean()``` or a special "marker value" like -1 or 1000. We'll first start with the average age and then refine this to use different averages for men and women.

In [12]:
tiFill = ti.copy()
tiFill.Age = tiFill.Age.fillna( tiFill.Age.mean() )
tiFill.Age.describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

We now have 891 data samples. The mean is the same, as we would expect. However, the mean age for women and men differs:

In [13]:
men = ti.Sex=='male'
women = ti.Sex!='male'
print('Mean age of men', ti[men].Age.mean())
print('Mean age of women', ti[women].Age.mean())

Mean age of men 30.72664459161148
Mean age of women 27.915708812260537

We can use data slices to update just the ages of the men or women to the average age of the appropriate gender. We're mainly doing this to show you how slicing and updating columns can be used to clean data in more flexible ways than the built-in Pandas routines.

You might think that you could simply write
```
tiFill.Age[men] = ...some value...
```
however, this will cause an error because of the way that Pandas manages copies of data when slicing out data. In this case, this is caused by the ```Age[men]``` part.

We will use the [**loc**](https://pandas.pydata.org/pandas-docs/stable/indexing.html) method of indexing the data frame. This does not slice the data into a new form and thus allows us to update the appropriate values for men and women.

The values we copy to the **tiFill** copy of the data is just the original data (for men or women) will the NaN entries filled by the appropriate mean age.

In [12]:
tiFill.loc[men, ['Age']] = ti[men].Age.fillna( ti[men].Age.mean() )
tiFill.loc[women, ['Age']] = ti[women].Age.fillna( ti[women].Age.mean() )
tiFill.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,30.726645,0,0,330877,8.4583,NaN,Q

We can see that the average age is now slightly larger (29.73) because there are more men and they were 3 years older than the women, on average.

In [14]:
tiFill.Age.describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

Dropping rows with NaN entries is easy, but may be heavy handed:

In [15]:
tiDropRow = ti.dropna()
print('The data frame now contains', tiDropRow.index.size, 'entries')
tiDropRow.head(6)

The data frame now contains 183 entries

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S

The simple ```dropna``` dropped the rows containing *any* NaN entries -- this includes all the NaN entries for Cabin as well as those for Age. This is probably not what you'd want to do in practice.

Another option is to drop the *columns* that have too many NaN entries. To do this, we'll use the same ```dropna``` method but specify the *other axis* -- in Pandas, data frames have two dimensions -- the horizontal (axis 0) and the verticle or columns (axis 1). Many methods can work on either axis.

We'll use other options for the [```DataFrame.dropna```](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) method to drop columns containing *any* NaN values.

In [16]:
tiDropCol = ti.dropna(axis='columns', how='any')
print('There are now', tiDropCol.index.size, 'rows')
tiDropCol.head(6)

There are now 891 rows

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
5,6,0,3,"Moran, Mr. James",male,0,0,330877,8.4583

The methods you use for cleaning your data will be very specific to the problem you're trying to solve, how many entries are missing data and what kind of data it is.

Once you've done your basic cleaning, you'll need to check that the data you have is meaningful using different summary statistics -- we'll cover this later.

## Changing Data Types

There's another problem with our data set -- some of the data is the wrong type or kind of data.

The **Survived** data indicates that it is an integer valued item. Lets examine the data using the Pandas ```describe()``` method.

In [17]:
print('Survived is', ti.Survived.dtype)
ti.Survived.describe()

Survived is int64

count    891.000000
mean       0.383838
std        0.486592
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        1.000000
Name: Survived, dtype: float64

 In fact, survival values of zero mean the person didn't survive and one means they did. The ```describe``` method is describing these values as if 0.5 or 2 would have meaning, but they don't given the data encoding.
 
 Survived is actually a *categorical* variable, even though it is expressed numerically. We will create a new column that encodes the data as categories and then describe it.

In [17]:
ti.Survived.astype('category').describe()

count     891
unique      2
top         0
freq      549
Name: Survived, dtype: int64

This description of the data makes more sense - there 891 entries, 2 unique values (0 and 1) and the top or most frequent value.

There are other columns that are really categorical are Pclass, Sex and Embarked. Most of the other (Cabin, Name) should just be treated as strings. Let's convert all of appropriate data to a categorical form:

In [18]:
ti.Survived = ti.Survived.astype('category')
ti.Sex = ti.Sex.astype('category')
ti.Pclass = ti.Pclass.astype('category')
ti.Embarked = ti.Embarked.astype('category')

## Grouping Data to Make Contingency Tables

We often want to understand relationships between different attributes (columns) of data based on the value of other columns. For example, we might want to know how ```Age``` differs for men and women.

This is such a common need that Pandas has a [mechanism called ```groupby```](http://pandas.pydata.org/pandas-docs/stable/groupby.html) to do this. There is [a compact tutorial by example](https://chrisalbon.com/python/data_wrangling/pandas_apply_operations_to_groups/).

One way to do that is to produce a *contingency table* that show one attribute (e.g. age) vs. another (e.g. sex). We can roll these by hand:

In [19]:
print('Average age of women is', ti[ti.Sex=='female'].Age.mean())
print('Average age of men is', ti[ti.Sex=='male'].Age.mean())

Average age of women is 27.915708812260537
Average age of men is 30.72664459161148

Pandas has a more general pattern called *split-apply-combine*. In our previous example, we split the data based on Sex and then *applied* a function (mean) to the result. Although we just printed our values, we would typically *combine* them into a new datastructure.

The *apply* phase can be either an aggregation step (_e.g._ compute mean or sums), a transformation (_e.g._ apply NaN's within groups derived from each group) or filtration (discarding specific data).

For example, if we wanted to see how many non-NaN values were in the dataframe for each Sex, we could use the ```count()``` aggregator.

In [22]:
ti.groupby(['Sex']).count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

Note that the age is only known for 261 women of the 314 that had a passenger id -- the other entries would have NaN values.

If we want to know the mean age or mean fare, we can do that:

In [23]:
ti.groupby(['Sex']).mean()

        PassengerId        Age     SibSp     Parch       Fare
Sex
female   431.028662  27.915709  0.694268  0.649682  44.479818
male     454.147314  30.726645  0.429809  0.235702  25.523893

Note that only numerical columns where shown -- you can't calculate the ```mean()``` of categorical data. If we wanted a specific column, we can do that do:

In [24]:
ti.groupby(['Sex']).Age.mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

We can also split the data based on multiple classes. Let's see how the mean fare differed for men and women in the different classes.

In [23]:
ti.groupby(['Sex','Pclass']).Fare.mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

We see that women paid more in each class -- but it's hard to see at a glance if women in each class were just charged a fixed percentage more or if it varied by class.

Since the ```groupby()``` returns a data structure, we can index it further to make comparisons. Let's compute the ratio between the price for women _v.s._ men by class.

In [25]:
mfare = ti.groupby(['Sex','Pclass']).Fare.mean()
mfare['female'] / mfare['male']

Pclass
1    1.578639
2    1.112874
3    1.273044
Name: Fare, dtype: float64

The transforming operation requires more programming chops than we've covered so far, but just to motivate you to understand why you should return to ```groupby``` and learn a little more Python, the following single line replaces all of the missing Age data with the mean of the specific group (male or female).

This uses a [lambda function](https://www.python-course.eu/lambda.php) to build a "throw away" function that fills NaN entries with the mean of the group.

We can see that Passenger #6 (in location 5), who had a missing age, now has the appropriate age for their gender.

In [25]:
tiGrpd = ti.groupby(['Sex']).Age.transform( lambda x: x.fillna( x.mean() ))
tiGrpd.head(6)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    30.726645
Name: Age, dtype: float64

In [26]:
def xform(x):
    return x.fillna(x.mean())

tiGrpd = ti.groupby(['Sex']).Age.transform( xform )
tiGrpd.head(6)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    30.726645
Name: Age, dtype: float64

In [27]:
add5 = lambda x: x + 5
print('add5(10) is', add5(10))

add5(10) is 15